aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
/* Variable(s) ------------------------------------------------------------------------------------------------------*/

static SD_Handle_t      SD_Handle;
static SD_CardInfo_t    SD_CardInfo;
static DSTATUS          Status;

/* Private function(s) ----------------------------------------------------------------------------------------------*/

static bool 	        SD_IsDetected               (void);
static void             SD_GetResponse              (uint32_t* pResponse);
static void             SD_DMA_Complete             (DMA_Stream_TypeDef* pDMA_Stream);
static SD_Error_t       SD_InitializeCard           (void);
static uint8_t 	        SD_ReadBlocks_DMA           (uint32_t *pData, uint64_t ReadAddr, uint32_t BlockSize, uint32_t NumOfBlocks);
static uint8_t 	        SD_WriteBlocks_DMA          (uint32_t *pData, uint64_t WriteAddr, uint32_t BlockSize, uint32_t NumOfBlocks);
static SD_Error_t       SD_CheckWriteOperation      (void);
static SD_Error_t       SD_CheckReadOperation       (void);
static SD_Error_t       SD_Select_Deselect          (uint64_t addr);
static SD_Error_t       SD_PowerON                  (void);
static void             SD_PowerOFF                 (void);
static SD_Error_t       SD_SendStatus               (uint32_t *pCardStatus);
static SD_Error_t       SD_IsCardProgramming        (uint8_t *pStatus);
static SD_Error_t       SD_CmdError                 (void);
static SD_Error_t       SD_CmdResp1Error            (uint8_t SD_CMD);
static SD_Error_t       SD_CmdResp7Error            (void);
static SD_Error_t       SD_CmdResp3Error            (void);
static SD_Error_t       SD_CmdResp2Error            (void);
static SD_Error_t       SD_CmdResp6Error            (uint8_t SD_CMD, uint16_t *pRCA);
static SD_Error_t       SD_WideBusOperationConfig   (uint32_t WideMode);
static SD_Error_t       SD_StopTransfer             (void);
static SD_Error_t       SD_HighSpeed                (void);
static SD_Error_t       SD_WideBusEnable            (void);
static SD_Error_t       SD_WideBusDisable           (void);
static SD_Error_t       SD_FindSCR                  (uint32_t *pSCR);

/** -----------------------------------------------------------------------------------------------------------------*/
/**		SD_IsDetected
  *
  * @brief  Test if card is present
  * @param  uint8_t       true or false
  */
static bool SD_IsDetected(void)
{
    return (IO_GetInputPinValue(SD_DETECT_GPIO_PORT, SD_DETECT_PIN) == 0);
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**		GetResponse
  *
  * @brief  Get response from SD device
  * @param  uint32_t*       pResponse
  */
static void SD_GetResponse(uint32_t* pResponse)
{
    if(pResponse != NULL)
    {
        pResponse[0] = SDMMC1->RESP1;
        pResponse[1] = SDMMC1->RESP2;
        pResponse[2] = SDMMC1->RESP3;
        pResponse[3] = SDMMC1->RESP4;
    }
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  SD DMA transfer complete Rx callback.
  */
static void SD_DMA_Complete(DMA_Stream_TypeDef* pDMA_Stream)
{
    SD_Handle.DMA_XferComplete = 1;          // DMA transfer is complete
    while(SD_Handle.TransferComplete == 0){}; // Wait until SD transfer is complete
    pDMA_Stream->CR &= ~DMA_SxCR_EN;        // Disable the stream
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Initializes all cards or single card as the case may be Card(s) come
  *         into standby state.
  * @retval SD Card error state
  */
static SD_Error_t SD_InitializeCard(void)
{
    SD_Error_t ErrorState = SD_OK;
    uint16_t sd_rca = 1;

    if((SDMMC1->POWER & SDMMC_POWER_PWRCTRL) == 0) // Power off
    {
        return SD_REQUEST_NOT_APPLICABLE;
    }

    if(SD_Handle.CardType != SECURE_DIGITAL_IO_CARD)
    {
        // Send CMD2 ALL_SEND_CID
        SDMMC1->ARG  =  (uint32_t)0;
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_ALL_SEND_CID | SDMMC_CMD_RESPONSE_LONG | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        if((ErrorState = SD_CmdResp2Error()) != SD_OK)
        {
            return ErrorState;
        }

        // Get Card identification number data
        SD_GetResponse(SD_Handle.CID);
    }

    if((SD_Handle.CardType == STD_CAPACITY_SD_CARD_V1_1)    || (SD_Handle.CardType == STD_CAPACITY_SD_CARD_V2_0) ||
       (SD_Handle.CardType == SECURE_DIGITAL_IO_COMBO_CARD) || (SD_Handle.CardType == HIGH_CAPACITY_SD_CARD))
    {
        // Send CMD3 SET_REL_ADDR with argument 0
        // SD Card publishes its RCA.
        SDMMC1->ARG  =  (uint32_t)0;
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_SET_REL_ADDR | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        if((ErrorState = SD_CmdResp6Error( SD_CMD_SET_REL_ADDR, &sd_rca)) != SD_OK)
        {
            return ErrorState;
        }
    }

    if(SD_Handle.CardType != SECURE_DIGITAL_IO_CARD)
    {
        // Get the SD card RCA
        SD_Handle.RCA = sd_rca;

        // Send CMD9 SEND_CSD with argument as card's RCA
        SDMMC1->ARG  =  (uint32_t)(uint32_t)(SD_Handle.RCA << 16);
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_SEND_CSD | SDMMC_CMD_RESPONSE_LONG | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        if((ErrorState = SD_CmdResp2Error()) == SD_OK)
        {
            // Get Card Specific Data
            SD_GetResponse(SD_Handle.CSD);
        }
    }

    // Card are initialized
    return ErrorState;
}

/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Reads block(s) from a specified address in a card. The Data transfer
  *         is managed by DMA mode.
  * @note   This API should be followed by the function SD_CheckReadOperation()
  *         to check the completion of the read process
  * @param  pReadBuffer: Pointer to the buffer that will contain the received data
  * @param  ReadAddr: Address from where data is to be read
  * @param  BlockSize: SD card Data block size
  * @note   BlockSize must be 512 bytes.
  * @param  NumberOfBlocks: Number of blocks to read.
  * @retval SD Card error state
  */
SD_Error_t SD_ReadBlocks_DMA(uint32_t *pReadBuffer, uint64_t ReadAddr, uint32_t BlockSize, uint32_t NumberOfBlocks)
{
    SD_Error_t ErrorState;
    uint32_t   CmdIndex;

    SDMMC1->DCTRL              = 0;                                                                 // Initialize data control register
    SD_Handle.TransferComplete = 0;                                                                 // Initialize handle flags
    SD_Handle.DMA_XferComplete = 0;
    SD_Handle.TransferError    = SD_OK;
    SD_Handle.Operation        = (NumberOfBlocks > 1) ? SD_MULTIPLE_BLOCK : SD_SINGLE_BLOCK;        // Initialize SD Read operation
    SDMMC1->MASK              |= (SDMMC_MASK_DCRCFAILIE | SDMMC_MASK_DTIMEOUTIE |                   // Enable transfer interrupts
                                  SDMMC_MASK_DATAENDIE  | SDMMC_MASK_RXOVERRIE);
    SDMMC1->DCTRL             |= SDMMC_DCTRL_DMAEN;                                                 // Enable SDMMC DMA transfer
    DMA2_Stream3->CR          &= ~DMA_SxCR_EN;                                                      // Disable the Peripheral
    DMA2_Stream3->NDTR         = (uint32_t)(BlockSize * NumberOfBlocks) / 4;                        // Configure DMA Stream data length
    DMA2_Stream3->M0AR         = (uint32_t)pReadBuffer;                                             // Configure DMA Stream destination address
    DMA2_Stream3->CR          |= DMA_SxCR_TCIE | DMA_SxCR_HTIE | DMA_SxCR_TEIE | DMA_SxCR_DMEIE;    // Enable all interrupts
    DMA2_Stream3->FCR         |= DMA_SxFCR_FEIE;
    DMA2_Stream3->CR          |= DMA_SxCR_EN;                                                       // Enable the Peripheral

    if(SD_Handle.CardType == HIGH_CAPACITY_SD_CARD)
    {
        BlockSize = 512;
        ReadAddr /= 512;
    }

    SDMMC1->ARG  =  (uint32_t)BlockSize;                                                            // Set Block Size for Card
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_SET_BLOCKLEN | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);
    if((ErrorState = SD_CmdResp1Error(SD_CMD_SET_BLOCKLEN)) != SD_OK)                               // Check for error conditions
    {
        return ErrorState;
    }

