aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
    // Configure the SD DPSM (Data Path State Machine)
    SDMMC1->DTIMER = SD_DATATIMEOUT;
    SDMMC1->DLEN   = BlockSize * NumberOfBlocks;
    SDMMC1->DCTRL &= ~(uint32_t)DCTRL_CLEAR_MASK;
    SDMMC1->DCTRL |=  (uint32_t)(SDMMC_DATABLOCK_SIZE_512B | SDMMC_DCTRL_DTDIR | SDMMC_DCTRL_DTEN);

    // Send CMD18 READ_MULT_BLOCK with argument data address
    // or send CMD17 READ_SINGLE_BLOCK depending on number of block
    CmdIndex = (NumberOfBlocks > 1) ? SD_CMD_READ_MULT_BLOCK : SD_CMD_READ_SINGLE_BLOCK;

    SDMMC1->ARG  =  (uint32_t)ReadAddr;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(CmdIndex | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);
    // Check for error conditions
    ErrorState = SD_CmdResp1Error((NumberOfBlocks > 1) ? SD_CMD_READ_MULT_BLOCK : SD_CMD_READ_SINGLE_BLOCK);

    // Update the SD transfer error in SD handle
    SD_Handle.TransferError = ErrorState;

    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Writes block(s) to a specified address in a card. The Data transfer
  *         is managed by DMA mode.
  * @note   This API should be followed by the function HAL_SD_CheckWriteOperation()
  *         to check the completion of the write process (by SD current status polling).
  * @param  pWriteBuffer: pointer to the buffer that will contain the data to transmit
  * @param  WriteAddr: Address from where data is to be read
  * @param  BlockSize: the SD card Data block size
  * @note   BlockSize must be 512 bytes.
  * @param  NumberOfBlocks: Number of blocks to write
  * @retval SD Card error state
  */
SD_Error_t SD_WriteBlocks_DMA(uint32_t *pWriteBuffer, uint64_t WriteAddr, uint32_t BlockSize, uint32_t NumberOfBlocks)
{
    SD_Error_t ErrorState;
    uint32_t   CmdIndex;

    SDMMC1->DCTRL               = 0;                                                                // Initialize data control register
    SD_Handle.TransferComplete  = 0;                                                                // Initialize handle flags
    SD_Handle.DMA_XferComplete  = 0;
    SD_Handle.TransferError     = SD_OK;
    SD_Handle.Operation         = (NumberOfBlocks > 1) ? SD_MULTIPLE_BLOCK : SD_SINGLE_BLOCK;       // Initialize SD Write operation
    SDMMC1->MASK               |= (SDMMC_MASK_DCRCFAILIE | SDMMC_MASK_DTIMEOUTIE |                  // Enable transfer interrupts
                                   SDMMC_MASK_DATAENDIE  | SDMMC_MASK_TXUNDERRIE);
    SDMMC1->DCTRL              |= SDMMC_DCTRL_DMAEN;                                                // Enable SDMMC DMA transfer
    DMA2_Stream6->CR           &= ~DMA_SxCR_EN;                                                     // Disable the Peripheral
    DMA2_Stream6->NDTR          = (uint32_t)(BlockSize * NumberOfBlocks) / 4;                       // Configure DMA Stream data length
    DMA2_Stream6->M0AR          = (uint32_t)pWriteBuffer;                                           // Configure DMA Stream destination address
    DMA2_Stream6->CR           |= DMA_SxCR_TCIE | DMA_SxCR_HTIE | DMA_SxCR_TEIE | DMA_SxCR_DMEIE;   // Enable all interrupts
    DMA2_Stream6->FCR          |= DMA_SxFCR_FEIE;
    DMA2_Stream6->CR           |= DMA_SxCR_EN;                                                      // Enable the Peripheral

    if(SD_Handle.CardType == HIGH_CAPACITY_SD_CARD)
    {
        BlockSize  = 512;
        WriteAddr /= 512;
    }

    SDMMC1->ARG  =  (uint32_t)BlockSize;                                                            // Set Block Size for Card
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_SET_BLOCKLEN | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);
    if((ErrorState = SD_CmdResp1Error( SD_CMD_SET_BLOCKLEN)) != SD_OK)                              // Check for error conditions
    {
        return ErrorState;
    }

    // Check number of blocks command
    // Send CMD24 WRITE_SINGLE_BLOCK
    // Send CMD25 WRITE_MULT_BLOCK with argument data address
    CmdIndex = (NumberOfBlocks > 1) ? SD_CMD_WRITE_MULT_BLOCK : SD_CMD_WRITE_SINGLE_BLOCK;

    // Set Block Size for Card
    SDMMC1->ARG  =  (uint32_t)WriteAddr;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(CmdIndex | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);
    // Check for error conditions
    if((SD_CmdResp1Error((NumberOfBlocks > 1) ? SD_CMD_WRITE_MULT_BLOCK : SD_CMD_WRITE_SINGLE_BLOCK)) != SD_OK)
    {
        return ErrorState;
    }

    // Configure the SD DPSM (Data Path State Machine)
    SDMMC1->DTIMER = SD_DATATIMEOUT;
    SDMMC1->DLEN   = (uint32_t)(BlockSize * NumberOfBlocks);
    SDMMC1->DCTRL &= ~(uint32_t)DCTRL_CLEAR_MASK;
    SDMMC1->DCTRL |=  (uint32_t)(SDMMC_DATABLOCK_SIZE_512B | SDMMC_DCTRL_DTEN);

    SD_Handle.TransferError = ErrorState;

    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  This function waits until the SD DMA data read transfer is finished.
  *         This API should be called after SD_ReadBlocks_DMA() function
  *         to insure that all data sent by the card is already transferred by the
  *         DMA controller.
  * @retval SD Card error state
  */
SD_Error_t SD_CheckReadOperation(void)
{
    SD_Error_t  ErrorState;
    uint32_t    TimeOut;
    uint32_t    tmp1;
    uint32_t    tmp2;
    SD_Error_t  tmp3;

    // Wait for DMA/SD transfer end or SD error variables to be in SD handle
    tmp1 = SD_Handle.DMA_XferComplete;
    tmp2 = SD_Handle.TransferComplete;
    tmp3 = (SD_Error_t)SD_Handle.TransferError;

    TimeOut = SD_DATATIMEOUT;
    while(((tmp1 & tmp2) == 0) && (tmp3 == SD_OK) && (TimeOut > 0))
    {
        tmp1 = SD_Handle.DMA_XferComplete;
        tmp2 = SD_Handle.TransferComplete;
        tmp3 = (SD_Error_t)SD_Handle.TransferError;
        TimeOut--;
    }

    // Wait until the Rx transfer is no longer active
    TimeOut = SD_DATATIMEOUT;
    while(((SDMMC1->STA & SDMMC_STA_RXACT) != 0) && (TimeOut > 0))
    {
        TimeOut--;
    }

    // Send stop command in multi block read
    if(SD_Handle.Operation == SD_MULTIPLE_BLOCK)
    {
        ErrorState = SD_StopTransfer();
    }

