aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
    if((TimeOut == 0) && (ErrorState == SD_OK))
    {
        ErrorState = SD_DATA_TIMEOUT;
    }

    // Clear all the static flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;

    // Return error state
    if(SD_Handle.TransferError != SD_OK)
    {
        return (SD_Error_t)(SD_Handle.TransferError);
    }

    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  This function waits until the SD DMA data write transfer is finished.
  *         This API should be called after SD_WriteBlocks_DMA() function
  *         to insure that all data sent by the card is already transferred by the
  *         DMA controller.
  * @retval SD Card error state
  */
SD_Error_t SD_CheckWriteOperation(void)
{
    SD_Error_t  ErrorState;
    uint32_t    TimeOut;
    uint32_t    tmp1;
    uint32_t    tmp2;
    SD_Error_t  tmp3;

    // Wait for DMA/SD transfer end or SD error variables to be in SD handle
    tmp1 = SD_Handle.DMA_XferComplete;
    tmp2 = SD_Handle.TransferComplete;
    tmp3 = (SD_Error_t)SD_Handle.TransferError;

    TimeOut = SD_DATATIMEOUT;
    while(((tmp1 & tmp2) == 0) && (tmp3 == SD_OK) && (TimeOut > 0))
    {
        tmp1 = SD_Handle.DMA_XferComplete;
        tmp2 = SD_Handle.TransferComplete;
        tmp3 = (SD_Error_t)SD_Handle.TransferError;
        TimeOut--;
    }

    // Wait until the Tx transfer is no longer active
    TimeOut = SD_DATATIMEOUT;
    while(((SDMMC1->STA & SDMMC_STA_TXACT) != 0) && (TimeOut > 0))
    {
        TimeOut--;
    }

    // Send stop command in multiblock write
    if(SD_Handle.Operation == SD_MULTIPLE_BLOCK)
    {
        ErrorState = SD_StopTransfer();
    }

    if((TimeOut == 0) && (ErrorState == SD_OK))
    {
        ErrorState = SD_DATA_TIMEOUT;
    }

    // Clear all the static flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;

    // Return error state
    if(SD_Handle.TransferError != SD_OK)
    {
        return (SD_Error_t)(SD_Handle.TransferError);
    }

    // Wait until write is complete
    while(SD_GetStatus() != SD_OK){};

    return ErrorState;
}

/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Erases the specified memory area of the given SD card.
  * @param  startaddr: Start byte address
  * @param  endaddr: End byte address
  * @retval SD Card error state
  */
SD_Error_t SD_Erase(uint64_t startaddr, uint64_t endaddr)
{
    SD_Error_t ErrorState = SD_OK;

    uint32_t delay         = 0;
    __IO uint32_t maxdelay = 0;
    uint8_t cardstate      = 0;

    // Check if the card command class supports erase command
    if(((SD_Handle.CSD[1] >> 20) & SD_CCCC_ERASE) == 0)
    {
        return SD_REQUEST_NOT_APPLICABLE;
    }

    // Get max delay value
    maxdelay = 120000 / (((SDMMC1->CLKCR) & 0xFF) + 2);

    if((SDMMC1->RESP1 & SD_CARD_LOCKED) == SD_CARD_LOCKED)
    {
        return SD_LOCK_UNLOCK_FAILED;
    }

    // Get start and end block for high capacity cards
    if(SD_Handle.CardType == HIGH_CAPACITY_SD_CARD)
    {
        startaddr /= 512;
        endaddr   /= 512;
    }

    // According to sd-card spec 1.0 ERASE_GROUP_START (CMD32) and erase_group_end(CMD33)
    if ((SD_Handle.CardType == STD_CAPACITY_SD_CARD_V1_1) || (SD_Handle.CardType == STD_CAPACITY_SD_CARD_V2_0) ||
        (SD_Handle.CardType == HIGH_CAPACITY_SD_CARD))
    {
        // Send CMD32 SD_ERASE_GRP_START with argument as addr
        SDMMC1->ARG  =  (uint32_t)startaddr;
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_SD_ERASE_GRP_START | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        if((ErrorState = SD_CmdResp1Error( SD_CMD_SD_ERASE_GRP_START)) != SD_OK)
        {
            return ErrorState;
        }

        // Send CMD33 SD_ERASE_GRP_END with argument as addr
        SDMMC1->ARG  =  (uint32_t)endaddr;
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_SD_ERASE_GRP_END | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        if((ErrorState = SD_CmdResp1Error( SD_CMD_SD_ERASE_GRP_END)) != SD_OK)
        {
            return ErrorState;
        }
    }

    // Send CMD38 ERASE
    SDMMC1->ARG  =  (uint32_t)0;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_ERASE  | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    if((ErrorState = SD_CmdResp1Error( SD_CMD_ERASE)) != SD_OK)
    {
        return ErrorState;
    }

    for(; delay < maxdelay; delay++);

    // Wait until the card is in programming state
    ErrorState = SD_IsCardProgramming( &cardstate);

    delay = SD_DATATIMEOUT;

    while((delay > 0) && (ErrorState == SD_OK) && ((cardstate == SD_CARD_PROGRAMMING) || (cardstate == SD_CARD_RECEIVING)))
    {
        ErrorState = SD_IsCardProgramming( &cardstate);
        delay--;
    }

    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Returns information about specific card.
  *         contains all SD cardinformation
  * @retval SD Card error state
  */
SD_Error_t SD_GetCardInfo(void)
{
    SD_Error_t ErrorState = SD_OK;
    uint32_t tmp = 0;

    SD_CardInfo.CardType = (uint8_t)(SD_Handle.CardType);
    SD_CardInfo.RCA      = (uint16_t)(SD_Handle.RCA);

    // Byte 0
    tmp = (SD_Handle.CSD[0] & 0xFF000000) >> 24;
    SD_CardInfo.SD_csd.CSDStruct      = (uint8_t)((tmp & 0xC0) >> 6);
    SD_CardInfo.SD_csd.SysSpecVersion = (uint8_t)((tmp & 0x3C) >> 2);
    SD_CardInfo.SD_csd.Reserved1      = tmp & 0x03;

    // Byte 1
    tmp = (SD_Handle.CSD[0] & 0x00FF0000) >> 16;
    SD_CardInfo.SD_csd.TAAC = (uint8_t)tmp;

    // Byte 2
    tmp = (SD_Handle.CSD[0] & 0x0000FF00) >> 8;
    SD_CardInfo.SD_csd.NSAC = (uint8_t)tmp;

    // Byte 3
    tmp = SD_Handle.CSD[0] & 0x000000FF;
    SD_CardInfo.SD_csd.MaxBusClkFrec = (uint8_t)tmp;

