aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
    // Byte 13
    tmp = (uint8_t)((SD_Handle.CID[3] & 0x00FF0000) >> 16);
    SD_CardInfo.SD_cid.Reserved1   |= (tmp & 0xF0) >> 4;
    SD_CardInfo.SD_cid.ManufactDate = (tmp & 0x0F) << 8;

    // Byte 14
    tmp = (uint8_t)((SD_Handle.CID[3] & 0x0000FF00) >> 8);
    SD_CardInfo.SD_cid.ManufactDate |= tmp;

    // Byte 15
    tmp = (uint8_t)(SD_Handle.CID[3] & 0x000000FF);
    SD_CardInfo.SD_cid.CID_CRC   = (tmp & 0xFE) >> 1;
    SD_CardInfo.SD_cid.Reserved2 = 1;

    return ErrorState;
}

/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Enables wide bus operation for the requested card if supported by
  *         card.
  * @param  WideMode: Specifies the SD card wide bus mode
  *          This parameter can be one of the following values:
  *            @arg SDMMC_BUS_WIDE_8B: 8-bit data transfer (Only for MMC)
  *            @arg SDMMC_BUS_WIDE_4B: 4-bit data transfer
  *            @arg SDMMC_BUS_WIDE_1B: 1-bit data transfer
  * @retval SD Card error state
  */
SD_Error_t SD_WideBusOperationConfig(uint32_t WideMode)
{
    SD_Error_t ErrorState;

    // MMC Card does not support this feature
    if(SD_Handle.CardType == MULTIMEDIA_CARD)
    {
        ErrorState = SD_UNSUPPORTED_FEATURE;
    }
    else if((SD_Handle.CardType == STD_CAPACITY_SD_CARD_V1_1) || (SD_Handle.CardType == STD_CAPACITY_SD_CARD_V2_0) ||\
            (SD_Handle.CardType == HIGH_CAPACITY_SD_CARD))
    {
             if(WideMode == SDMMC_BUS_WIDE_8B)  ErrorState = SD_UNSUPPORTED_FEATURE;
        else if(WideMode == SDMMC_BUS_WIDE_4B)  ErrorState = SD_WideBusEnable();
        else if(WideMode == SDMMC_BUS_WIDE_1B)  ErrorState = SD_WideBusDisable();
        else                                    ErrorState = SD_INVALID_PARAMETER;  // WideMode is not a valid argument

        if(ErrorState == SD_OK)
        {
            // Configure the SDMMC peripheral
            SDMMC1->CLKCR &= ~(uint32_t)CLKCR_CLEAR_MASK;
            SDMMC1->CLKCR |=  (uint32_t)WideMode;
        }
    }

    return ErrorState;
}

/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Aborts an ongoing data transfer.
  * @retval SD Card error state
  */
SD_Error_t SD_StopTransfer(void)
{
    // Send CMD12 STOP_TRANSMISSION
    SDMMC1->ARG  =  (uint32_t)0;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_STOP_TRANSMISSION | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    return SD_CmdResp1Error(SD_CMD_STOP_TRANSMISSION);;
}

/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Switches the SD card to High Speed mode.
  *         This API must be used after "Transfer State"
  * @retval SD Card error state
  */
SD_Error_t HAL_SD_HighSpeed(void)
{
    SD_Error_t ErrorState = SD_OK;

    uint8_t SD_hs[64]  = {0};
    uint32_t SD_scr[2] = {0, 0};
    uint32_t SD_SPEC   = 0;
    uint32_t count = 0, *tempbuff = (uint32_t *)SD_hs;

    // Initialize the Data control register
    SDMMC1->DCTRL = 0;

    // Get SCR Register
    if((ErrorState = SD_FindSCR( SD_scr)) != SD_OK)
    {
        return ErrorState;
    }

    // Test the Version supported by the card
    SD_SPEC = (SD_scr[1]  & 0x01000000) | (SD_scr[1]  & 0x02000000);

    if(SD_SPEC != SD_ALLZERO)
    {
        // Set Block Size for Card
        SDMMC1->ARG  =  (uint32_t)64;
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_SET_BLOCKLEN | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        if((ErrorState = SD_CmdResp1Error( SD_CMD_SET_BLOCKLEN)) != SD_OK)
        {
            return ErrorState;
        }

        // Configure the SD DPSM (Data Path State Machine)
        SDMMC1->DTIMER = SD_DATATIMEOUT;
        SDMMC1->DLEN   = 64;
        SDMMC1->DCTRL &= ~(uint32_t)DCTRL_CLEAR_MASK;
        SDMMC1->DCTRL |=  (uint32_t)(SDMMC_DATABLOCK_SIZE_64B | SDMMC_DCTRL_DTDIR | SDMMC_DCTRL_DTEN);

        // Send CMD6 switch mode
        SDMMC1->ARG  =  (uint32_t)0x80FFFF01;
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_HS_SWITCH | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        if((ErrorState = SD_CmdResp1Error( SD_CMD_HS_SWITCH)) != SD_OK)
        {
            return ErrorState;
        }

        while((SDMMC1->STA & (SDMMC_STA_RXOVERR | SDMMC_STA_DCRCFAIL | SDMMC_STA_DTIMEOUT | SDMMC_STA_DBCKEND)) == 0)
        {
            if((SDMMC1->STA & SDMMC_STA_RXFIFOHF) != 0)
            {
                for (count = 0; count < 8; count++)
                {
                    *(tempbuff + count) = SDMMC1->FIFO;
                }

                tempbuff += 8;
            }
        }

        if((SDMMC1->STA & SDMMC_STA_DTIMEOUT) != 0)
        {
            SDMMC1->ICR = SDMMC_ICR_DTIMEOUTC;
            return SD_DATA_TIMEOUT;
        }
        else if((SDMMC1->STA & SDMMC_STA_DCRCFAIL) != 0)
        {
            SDMMC1->ICR = SDMMC_ICR_DCRCFAILC;
            return SD_DATA_CRC_FAIL;
        }
        else if((SDMMC1->STA & SDMMC_STA_RXOVERR) != 0)
        {
            SDMMC1->ICR = SDMMC_ICR_RXOVERRC;
            return SD_RX_OVERRUN;
        }

        count = SD_DATATIMEOUT;

        while(((SDMMC1->STA & SDMMC_STA_RXDAVL) != 0) && (count > 0))
        {
            *tempbuff = SDMMC1->FIFO;
            tempbuff++;
            count--;
        }

        // Clear all the static flags
        SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;

        // Test if the switch mode HS is ok
        if((SD_hs[13]& 2) != 2)
        {
            ErrorState = SD_UNSUPPORTED_FEATURE;
        }
    }

    return ErrorState;
}


