aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Returns the current SD card's status.
  * @param  pSDstatus: Pointer to the buffer that will contain the SD card status
  * @retval SD Card error state
  */
SD_Error_t HAL_SD_SendSDStatus(uint32_t *pSDstatus)
{
    SD_Error_t ErrorState = SD_OK;
    uint32_t count = 0;

    // Check SD response
    if((SDMMC1->RESP1 & SD_CARD_LOCKED) == SD_CARD_LOCKED)
    {
        return SD_LOCK_UNLOCK_FAILED;
    }

    // Set block size for card if it is not equal to current block size for card
    SDMMC1->ARG  =  (uint32_t)64;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_SET_BLOCKLEN | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    if((ErrorState = SD_CmdResp1Error( SD_CMD_SET_BLOCKLEN)) != SD_OK)
    {
        return ErrorState;
    }

    // Send CMD55
    SDMMC1->ARG  =  (uint32_t)(SD_Handle.RCA << 16);
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_APP_CMD | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    if((ErrorState = SD_CmdResp1Error( SD_CMD_APP_CMD)) != SD_OK)
    {
        return ErrorState;
    }

    // Configure the SD DPSM (Data Path State Machine)
    SDMMC1->DTIMER = SD_DATATIMEOUT;
    SDMMC1->DLEN   = 64;
    SDMMC1->DCTRL &= ~(uint32_t)DCTRL_CLEAR_MASK;
    SDMMC1->DCTRL |=  (uint32_t)(SDMMC_DATABLOCK_SIZE_64B | SDMMC_DCTRL_DTDIR | SDMMC_DCTRL_DTEN);

    // Send ACMD13 (SD_APP_STAUS)  with argument as card's RCA */
    SDMMC1->ARG  =  (uint32_t)0;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_SD_APP_STATUS | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    if((ErrorState = SD_CmdResp1Error( SD_CMD_SD_APP_STATUS)) != SD_OK)
    {
        return ErrorState;
    }

    // Get status data
    while((SDMMC1->STA & (SDMMC_STA_RXOVERR | SDMMC_STA_DCRCFAIL | SDMMC_STA_DTIMEOUT | SDMMC_STA_DBCKEND)) == 0)
    {
        if((SDMMC1->STA & SDMMC_STA_RXFIFOHF) != 0)
        {
            for(count = 0; count < 8; count++)
            {
                *(pSDstatus + count) = SDMMC1->FIFO;
            }

            pSDstatus += 8;
        }
    }

    if((SDMMC1->STA & SDMMC_STA_DTIMEOUT) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_DTIMEOUTC;
        return SD_DATA_TIMEOUT;
    }
    else if((SDMMC1->STA & SDMMC_STA_DCRCFAIL) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_DCRCFAILC;
        return SD_DATA_CRC_FAIL;
    }
    else if((SDMMC1->STA & SDMMC_STA_RXOVERR) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_RXOVERRC;
        return SD_RX_OVERRUN;
    }

    count = SD_DATATIMEOUT;
    while(((SDMMC1->STA & SDMMC_STA_RXDAVL) != 0) && (count > 0))
    {
        *pSDstatus = SDMMC1->FIFO;
        pSDstatus++;
        count--;
    }

    // Clear all the static status flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;
    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Gets the current sd card data status.
  * @retval Data Transfer state
  */
SD_Error_t SD_GetStatus(void)
{
    uint32_t       resp1;
    SD_CardState_t CardState;

    resp1     = 0;
    CardState = SD_CARD_TRANSFER;

    // Get SD card state
    if(SD_SendStatus(&resp1) != SD_OK) CardState =  SD_CARD_ERROR;
    else                               CardState = (SD_CardState_t)((resp1 >> 9) & 0x0F);

    // Find SD status according to card state
    if     (CardState == SD_CARD_TRANSFER)  return SD_OK;
    else if(CardState == SD_CARD_ERROR)     return SD_ERROR;
    else                                    return SD_BUSY;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Gets the SD card status.
  * @retval SD Card error state
  */
SD_Error_t SD_GetCardStatus(SD_CardStatus_t* pCardStatus)
{
    SD_Error_t ErrorState;
    uint32_t tmp = 0;
    uint32_t sd_status[16];

    if((ErrorState = SD_SendSDStatus( sd_status)) != SD_OK)
    {
        return ErrorState;
    }

    // Byte 0
    tmp = (sd_status[0] & 0xC0) >> 6;
    pCardStatus->DAT_BUS_WIDTH = (uint8_t)tmp;

    // Byte 0
    tmp = (sd_status[0] & 0x20) >> 5;
    pCardStatus->SECURED_MODE = (uint8_t)tmp;

    // Byte 2
    tmp = (sd_status[2] & 0xFF);
    pCardStatus->SD_CARD_TYPE = (uint8_t)(tmp << 8);

    // Byte 3
    tmp = (sd_status[3] & 0xFF);
    pCardStatus->SD_CARD_TYPE |= (uint8_t)tmp;

    // Byte 4
    tmp = (sd_status[4] & 0xFF);
    pCardStatus->SIZE_OF_PROTECTED_AREA = (uint8_t)(tmp << 24);

    // Byte 5
    tmp = (sd_status[5] & 0xFF);
    pCardStatus->SIZE_OF_PROTECTED_AREA |= (uint8_t)(tmp << 16);

    // Byte 6
    tmp = (sd_status[6] & 0xFF);
    pCardStatus->SIZE_OF_PROTECTED_AREA |= (uint8_t)(tmp << 8);

    // Byte 7
    tmp = (sd_status[7] & 0xFF);
    pCardStatus->SIZE_OF_PROTECTED_AREA |= (uint8_t)tmp;

    // Byte 8
    tmp = (sd_status[8] & 0xFF);
    pCardStatus->SPEED_CLASS = (uint8_t)tmp;

    // Byte 9
    tmp = (sd_status[9] & 0xFF);
    pCardStatus->PERFORMANCE_MOVE = (uint8_t)tmp;

    // Byte 10
    tmp = (sd_status[10] & 0xF0) >> 4;
    pCardStatus->AU_SIZE = (uint8_t)tmp;

    // Byte 11
    tmp = (sd_status[11] & 0xFF);
    pCardStatus->ERASE_SIZE = (uint8_t)(tmp << 8);

    // Byte 12
    tmp = (sd_status[12] & 0xFF);
    pCardStatus->ERASE_SIZE |= (uint8_t)tmp;

    // Byte 13
    tmp = (sd_status[13] & 0xFC) >> 2;
    pCardStatus->ERASE_TIMEOUT = (uint8_t)tmp;

    // Byte 13
    tmp = (sd_status[13] & 0x3);
    pCardStatus->ERASE_OFFSET = (uint8_t)tmp;

    return SD_OK;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Selects od Deselects the corresponding card.
  * @param  addr: Address of the card to be selected
  * @retval SD Card error state
  */
static SD_Error_t SD_Select_Deselect(uint64_t addr)
{
    // Send CMD7 SDMMC_SEL_DESEL_CARD
    SDMMC1->ARG  =  (uint32_t)addr;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_SEL_DESEL_CARD | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // check for error conditions
    return SD_CmdResp1Error( SD_CMD_SEL_DESEL_CARD);
}


