aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Enquires cards about their operating voltage and configures clock
  *         controls and stores SD information that will be needed in future
  *         in the SD handle.
  * @retval SD Card error state
  */
static SD_Error_t SD_PowerON(void)
{
    SD_Error_t ErrorState = SD_OK;
    uint32_t response = 0, count = 0, validvoltage = 0;
    uint32_t sdtype = SD_STD_CAPACITY;

    // Power ON Sequence -------------------------------------------------------
    SDMMC1->CLKCR &= ~SDMMC_CLKCR_CLKEN;        // Disable SDMMC Clock
    SDMMC1->POWER = SDMMC_POWER_PWRCTRL;        // Set Power State to ON

    // 1ms: required power up waiting time before starting the SD initialization sequence
    uint32_t tickstart = 0;
    tickstart = Tick;
    while((Tick - tickstart) < 1) {};

    SDMMC1->CLKCR |= SDMMC_CLKCR_CLKEN;           // Enable SDMMC Clock

    // CMD0: GO_IDLE_STATE -----------------------------------------------------
    // No CMD response required
    SDMMC1->ARG  =  0;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_GO_IDLE_STATE | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    if((ErrorState = SD_CmdError()) != SD_OK)
    {
        // CMD Response Timeout (wait for CMDSENT flag)
        return ErrorState;
    }

    // CMD8: SEND_IF_COND ------------------------------------------------------
    // Send CMD8 to verify SD card interface operating condition
    // Argument: - [31:12]: Reserved (shall be set to '0')
    //- [11:8]: Supply Voltage (VHS) 0x1 (Range: 2.7-3.6 V)
    //- [7:0]: Check Pattern (recommended 0xAA)
    // CMD Response: R7 */
    SDMMC1->ARG  =  SD_CHECK_PATTERN;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_SDMMC_SEND_IF_COND | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    if((ErrorState = SD_CmdResp7Error()) == SD_OK)
    {
        // SD Card 2.0
        SD_Handle.CardType = STD_CAPACITY_SD_CARD_V2_0;
        sdtype        = SD_HIGH_CAPACITY;
    }

    // Send CMD55
    SDMMC1->ARG  =  (uint32_t)0;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_APP_CMD | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    // If ErrorState is Command Timeout, it is a MMC card
    // If ErrorState is SD_OK it is a SD card: SD card 2.0 (voltage range mismatch) or SD card 1.x
    if((ErrorState = SD_CmdResp1Error(SD_CMD_APP_CMD)) == SD_OK)
    {
        // SD CARD
        // Send ACMD41 SD_APP_OP_COND with Argument 0x80100000
        while((!validvoltage) && (count < SD_MAX_VOLT_TRIAL))
        {

            // SEND CMD55 APP_CMD with RCA as 0
            SDMMC1->ARG  =  (uint32_t)0;
            SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
            SDMMC1->CMD |=  (uint32_t)(SD_CMD_APP_CMD | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

            // Check for error conditions
            if((ErrorState = SD_CmdResp1Error( SD_CMD_APP_CMD)) != SD_OK)
            {
                return ErrorState;
            }

            // Send CMD41
            SDMMC1->ARG  =  SD_VOLTAGE_WINDOW_SD | sdtype;
            SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
            SDMMC1->CMD |=  (uint32_t)(SD_CMD_SD_APP_OP_COND | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

            // Check for error conditions
            if((ErrorState = SD_CmdResp3Error()) != SD_OK)
            {
                return ErrorState;
            }

            response = SDMMC1->RESP1;                               // Get command response
            validvoltage = (((response >> 31) == 1) ? 1 : 0);       // Get operating voltage
            count++;
        }

        if(count >= SD_MAX_VOLT_TRIAL)
        {
            return SD_INVALID_VOLTRANGE;
        }

        if((response & SD_HIGH_CAPACITY) == SD_HIGH_CAPACITY) /* (response &= SD_HIGH_CAPACITY) */
        {
            SD_Handle.CardType = HIGH_CAPACITY_SD_CARD;
        }
    } // else MMC Card

    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Turns the SDMMC output signals off.
  * @retval SD Card error state
  */
static void SD_PowerOFF(void)
{
   // Set Power State to OFF
   SDMMC1->POWER = (uint32_t)0;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Returns the current card's status.
  * @param  pCardStatus: pointer to the buffer that will contain the SD card
  *         status (Card Status register)
  * @retval SD Card error state
  */
static SD_Error_t SD_SendStatus(uint32_t *pCardStatus)
{
    SD_Error_t ErrorState;

    // Send Status command
    SDMMC1->ARG  =  (uint32_t)(SD_Handle.RCA << 16);
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_SEND_STATUS | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    if((ErrorState = SD_CmdResp1Error( SD_CMD_SEND_STATUS)) == SD_OK)
    {
        *pCardStatus = SDMMC1->RESP1;
    }

    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Checks for error conditions for CMD0.
  * @retval SD Card error state
  */
static SD_Error_t SD_CmdError(void)
{
    uint32_t timeout, tmp;

    timeout = SDMMC_CMD0TIMEOUT;

    tmp = SDMMC1->STA & SDMMC_STA_CMDSENT;

    while((timeout > 0) && (tmp == 0))
    {
        tmp = SDMMC1->STA & SDMMC_STA_CMDSENT;
        timeout--;
    }

    if(timeout == 0)
    {
        return SD_CMD_RSP_TIMEOUT;
    }

    // Clear all the static flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;
    return SD_OK;
}


