aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
    // Send ACMD51 SD_APP_SEND_SCR with argument as 0
    SDMMC1->ARG  =  (uint32_t)0;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_SD_APP_SEND_SCR | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    ErrorState = SD_CmdResp1Error( SD_CMD_SD_APP_SEND_SCR);

    if(ErrorState != SD_OK)
    {
        return ErrorState;
    }

    while((SDMMC1->STA & (SDMMC_STA_RXOVERR | SDMMC_STA_DCRCFAIL | SDMMC_STA_DTIMEOUT | SDMMC_STA_DBCKEND)) == 0)
    {
        if((SDMMC1->STA & SDMMC_STA_RXDAVL) != 0)
        {
            *(tempscr + index) = SDMMC1->FIFO;
            index++;
        }
    }

    if((SDMMC1->STA & SDMMC_STA_DTIMEOUT) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_DTIMEOUTC;
        ErrorState = SD_DATA_TIMEOUT;
    }
    else if((SDMMC1->STA & SDMMC_STA_DCRCFAIL) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_DCRCFAILC;
        ErrorState = SD_DATA_CRC_FAIL;
    }
    else if((SDMMC1->STA & SDMMC_STA_RXOVERR) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_RXOVERRC;
        ErrorState = SD_RX_OVERRUN;
    }
    else
    {
        // Clear all the static flags
        SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;

        *(pSCR + 1) = ((tempscr[0] & SD_0TO7BITS) << 24)  | ((tempscr[0] & SD_8TO15BITS) << 8) |
                      ((tempscr[0] & SD_16TO23BITS) >> 8) | ((tempscr[0] & SD_24TO31BITS) >> 24);

        *(pSCR) = ((tempscr[1] & SD_0TO7BITS) << 24)  | ((tempscr[1] & SD_8TO15BITS) << 8) |
                  ((tempscr[1] & SD_16TO23BITS) >> 8) | ((tempscr[1] & SD_24TO31BITS) >> 24);
    }

    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Checks if the SD card is in programming state.
  * @param  pStatus: pointer to the variable that will contain the SD card state
  * @retval SD Card error state
  */
static SD_Error_t SD_IsCardProgramming(uint8_t *pStatus)
{
    SD_Error_t ErrorState = SD_OK;
    uint32_t responseR1 = 0;

    SDMMC1->ARG  =  (uint32_t)(SD_Handle.RCA << 16);
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_SEND_STATUS | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    while((SDMMC1->STA & (SDMMC_STA_CCRCFAIL | SDMMC_STA_CMDREND | SDMMC_STA_CTIMEOUT)) == 0){};

    if((SDMMC1->STA & SDMMC_STA_CTIMEOUT) != 0)
    {
        ErrorState = SD_CMD_RSP_TIMEOUT;
        SDMMC1->ICR = SDMMC_ICR_CTIMEOUTC;
        return ErrorState;
    }
    else if((SDMMC1->STA & SDMMC_STA_CCRCFAIL) != 0)
    {
        ErrorState = SD_CMD_CRC_FAIL;
        SDMMC1->ICR = SDMMC_ICR_CCRCFAILC;
        return ErrorState;
    }
    else
    {
        // No error flag set
    }

    // Check response received is of desired command
    if((uint32_t)SDMMC1->RESPCMD != SD_CMD_SEND_STATUS)
    {
        ErrorState = SD_ILLEGAL_CMD;
        return ErrorState;
    }

    // Clear all the static flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;

    // We have received response, retrieve it for analysis
    responseR1 = SDMMC1->RESP1;

    // Find out card status
    *pStatus = (uint8_t)((responseR1 >> 9) & 0x0000000F);

    if((responseR1 & SD_OCR_ERRORBITS)              == SD_ALLZERO)                      return ErrorState;
    if((responseR1 & SD_OCR_ADDR_OUT_OF_RANGE)      == SD_OCR_ADDR_OUT_OF_RANGE)        return SD_ADDR_OUT_OF_RANGE;
    if((responseR1 & SD_OCR_ADDR_MISALIGNED)        == SD_OCR_ADDR_MISALIGNED)          return SD_ADDR_MISALIGNED;
    if((responseR1 & SD_OCR_BLOCK_LEN_ERR)          == SD_OCR_BLOCK_LEN_ERR)            return SD_BLOCK_LEN_ERR;
    if((responseR1 & SD_OCR_ERASE_SEQ_ERR)          == SD_OCR_ERASE_SEQ_ERR)            return SD_ERASE_SEQ_ERR;
    if((responseR1 & SD_OCR_BAD_ERASE_PARAM)        == SD_OCR_BAD_ERASE_PARAM)          return SD_BAD_ERASE_PARAM;
    if((responseR1 & SD_OCR_WRITE_PROT_VIOLATION)   == SD_OCR_WRITE_PROT_VIOLATION)     return SD_WRITE_PROT_VIOLATION;
    if((responseR1 & SD_OCR_LOCK_UNLOCK_FAILED)     == SD_OCR_LOCK_UNLOCK_FAILED)       return SD_LOCK_UNLOCK_FAILED;
    if((responseR1 & SD_OCR_COM_CRC_FAILED)         == SD_OCR_COM_CRC_FAILED)           return SD_COM_CRC_FAILED;
    if((responseR1 & SD_OCR_ILLEGAL_CMD)            == SD_OCR_ILLEGAL_CMD)              return SD_ILLEGAL_CMD;
    if((responseR1 & SD_OCR_CARD_ECC_FAILED)        == SD_OCR_CARD_ECC_FAILED)          return SD_CARD_ECC_FAILED;
    if((responseR1 & SD_OCR_CC_ERROR)               == SD_OCR_CC_ERROR)                 return SD_CC_ERROR;
    if((responseR1 & SD_OCR_GENERAL_UNKNOWN_ERROR)  == SD_OCR_GENERAL_UNKNOWN_ERROR)    return SD_GENERAL_UNKNOWN_ERROR;
    if((responseR1 & SD_OCR_STREAM_READ_UNDERRUN)   == SD_OCR_STREAM_READ_UNDERRUN)     return SD_STREAM_READ_UNDERRUN;
    if((responseR1 & SD_OCR_STREAM_WRITE_OVERRUN)   == SD_OCR_STREAM_WRITE_OVERRUN)     return SD_STREAM_WRITE_OVERRUN;
    if((responseR1 & SD_OCR_CID_CSD_OVERWRITE)      == SD_OCR_CID_CSD_OVERWRITE)        return SD_CID_CSD_OVERWRITE;
    if((responseR1 & SD_OCR_WP_ERASE_SKIP)          == SD_OCR_WP_ERASE_SKIP)            return SD_WP_ERASE_SKIP;
    if((responseR1 & SD_OCR_CARD_ECC_DISABLED)      == SD_OCR_CARD_ECC_DISABLED)        return SD_CARD_ECC_DISABLED;
    if((responseR1 & SD_OCR_ERASE_RESET)            == SD_OCR_ERASE_RESET)              return SD_ERASE_RESET;
    if((responseR1 & SD_OCR_AKE_SEQ_ERROR)          == SD_OCR_AKE_SEQ_ERROR)            return SD_AKE_SEQ_ERROR;
    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Initialize the SDMMC1 module, DMA, and IO
  */
void SD_Initialize(void)
{
    uint32_t prioritygroup;

     // Reset SDIO Module
    RCC->APB2RSTR |=  RCC_APB2RSTR_SDMMC1RST;
    RCC->APB2RSTR &= ~RCC_APB2RSTR_SDMMC1RST;

    // Enable SDIO clock
    RCC->APB2ENR |= RCC_APB2ENR_SDMMC1EN;

    // Enable DMA2 clocks
    RCC->AHB1ENR |= RCC_AHB1ENR_DMA2EN;

