aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
	IO_PinInit(GPIOC,               RCC_AHB1ENR_GPIOCEN, GPIO_PIN_8,    GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(GPIOC,               RCC_AHB1ENR_GPIOCEN, GPIO_PIN_9,    GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(GPIOC,               RCC_AHB1ENR_GPIOCEN, GPIO_PIN_10,   GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(GPIOC,               RCC_AHB1ENR_GPIOCEN, GPIO_PIN_11,   GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(GPIOC,               RCC_AHB1ENR_GPIOCEN, GPIO_PIN_12,   GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(GPIOD,               RCC_AHB1ENR_GPIODEN, GPIO_PIN_2,    GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(SD_DETECT_GPIO_PORT, RCC_AHB1ENR_GPIOCEN, SD_DETECT_PIN, GPIO_MODER_INPUT,     GPIO_TYPE_PIN_PULL_UP, GPIO_OSPEEDR_LOW,       0);

    prioritygroup = NVIC_GetPriorityGrouping();

    // NVIC configuration for SDIO interrupts
    NVIC_SetPriority(SDMMC1_IRQn, NVIC_EncodePriority(prioritygroup, 5, 0));
    NVIC_EnableIRQ(SDMMC1_IRQn);

    // Initialize DMA2 channel 3 for RX from SD CARD
    DMA2_Stream3->CR   = 0;                                                 // Reset DMA Stream control register
    DMA2_Stream3->PAR  = (uint32_t)&SDMMC1->FIFO;
    DMA2->LIFCR        = IFCR_CLEAR_MASK_STREAM3;                           // Clear all interrupt flags
    DMA2_Stream3->CR   = (DMA_CHANNEL_4        | DMA_SxCR_PFCTRL        |   // Prepare the DMA Stream configuration
                          DMA_MINC_ENABLE      | DMA_PDATAALIGN_WORD    |   // And write to DMA Stream CR register
                          DMA_MDATAALIGN_WORD  | DMA_PRIORITY_VERY_HIGH |
                          DMA_MBURST_INC4      | DMA_PBURST_INC4);

    DMA2_Stream3->FCR  = (DMA_SxFCR_DMDIS | DMA_SxFCR_FTH);                 // Configuration FIFO control register

    // Initialize DMA2 channel 6 for TX to SD CARD
    DMA2_Stream6->CR   = 0;                                                 // Reset DMA Stream control register
    DMA2_Stream6->PAR  = (uint32_t)&SDMMC1->FIFO;
    DMA2->HIFCR        = IFCR_CLEAR_MASK_STREAM6;                           // Clear all interrupt flags
    DMA2_Stream6->CR   = (DMA_CHANNEL_4        | DMA_SxCR_PFCTRL        |   // Prepare the DMA Stream configuration
                          DMA_MINC_ENABLE      | DMA_PDATAALIGN_WORD    |   // And write to DMA Stream CR register
                          DMA_MDATAALIGN_WORD  | DMA_PRIORITY_VERY_HIGH |
                          DMA_MBURST_INC4      | DMA_PBURST_INC4        |
                          DMA_MEMORY_TO_PERIPH);
    DMA2_Stream6->FCR  = (DMA_SxFCR_DMDIS | DMA_SxFCR_FTH);                 // Configuration FIFO control register

    // NVIC configuration for DMA transfer complete interrupt
    NVIC_SetPriority(DMA2_Stream3_IRQn, NVIC_EncodePriority(prioritygroup, 6, 0));
    NVIC_EnableIRQ(DMA2_Stream3_IRQn);

    NVIC_SetPriority(DMA2_Stream6_IRQn, NVIC_EncodePriority(prioritygroup, 6, 0));
    NVIC_EnableIRQ(DMA2_Stream6_IRQn);
}


/** -----------------------------------------------------------------------------------------------------------------*/
DSTATUS FATFS_SD_disk_initialize(void)
{
	SD_Error_t ErrorState;

	// Check if SD card is present
	if(SD_IsDetected() != SD_PRESENT)
    {
        return MSD_ERROR_SD_NOT_PRESENT;
    }

    // Initialize SDMMC peripheral interface with default configuration for SD card initialization
    SDMMC1->CLKCR &= ~(uint32_t)CLKCR_CLEAR_MASK;
    SDMMC1->CLKCR |=  (uint32_t)SDMMC_INIT_CLK_DIV;

    if((ErrorState = SD_PowerON()) == SD_OK)                    // Identify card operating voltage
    {
        if(ErrorState = SD_InitializeCard() == SD_OK)           // Initialize the present card and put them in idle state
        {
            if((ErrorState = SD_GetCardInfo()) == SD_OK)        // Read CSD/CID MSD registers
            {                                                   // Select the Card
                ErrorState = SD_Select_Deselect((uint32_t)(((uint32_t)SD_CardInfo.RCA) << 16));
                SDMMC1->CLKCR &= ~(uint32_t)CLKCR_CLEAR_MASK;   // Configure SDMMC peripheral interface
            }
        }
    }

	// Configure SD Bus width
	if(ErrorState == SD_OK)
	{
		// Enable wide operation
		ErrorState = SD_WideBusOperationConfig(SDMMC_BUS_WIDE_4B);
	}

	// Configure the SDCARD device
	Status = STA_NOINIT;
	if(ErrorState == SD_OK)
    {
        Status &= ~STA_NOINIT;
    }

	return Status;
}


/** -----------------------------------------------------------------------------------------------------------------*/
DSTATUS FATFS_SD_disk_status(void)
{
	Status = STA_NOINIT;

	// Check SDCARD status
	if(SD_GetStatus() == SD_OK) Status &= ~STA_NOINIT;
	else                        Status |= STA_NOINIT;

	return Status;
}


/** -----------------------------------------------------------------------------------------------------------------*/
DRESULT FATFS_SD_disk_ioctl(BYTE cmd, void *buff)
{
	DRESULT res = RES_ERROR;

	// Check if init OK
	if(Status & STA_NOINIT) return RES_NOTRDY;

	switch(cmd)
	{
		// Make sure that no pending write process
		case CTRL_SYNC:
        {
			res = RES_OK;
			break;
        }

		// Get number of sectors on the disk (DWORD)
		case GET_SECTOR_COUNT:
        {
			SD_GetCardInfo();
			*(DWORD *)buff = SD_CardInfo.CardCapacity / BLOCK_SIZE;
			res = RES_OK;
			break;
        }

		// Get R/W sector size (WORD)
		case GET_SECTOR_SIZE:
        {
			*(WORD *)buff = BLOCK_SIZE;
			res = RES_OK;
			break;
        }

		// Get erase block size in unit of sector (DWORD)
		case GET_BLOCK_SIZE:
        {
			*(DWORD*)buff = BLOCK_SIZE;
			break;
        }

		default:
        {
			res = RES_PARERR;
        }
	}

	return res;
}


